Revit 2021.1 API
EnergyModelType Enumeration
 This enum is used to define if the energy model is based on rooms/spaces or building elements.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2016
Syntax
C#
public enum EnergyModelType
Visual Basic
Public Enumeration EnergyModelType
Visual C++
public enum class EnergyModelType
Members
Member name | Description
SpatialElement |  Energy model based on rooms or spaces.
BuildingElement |  The building element based energy analytical model.
See Also
Autodesk.Revit.DB.Analysis Namespace